import React from 'react';
import './AboutPage.css';  
import ph2 from '../img/map1.png';
import ph3 from '../img/map2.png';

const AboutPage = () => {
  return (
    <div className="about-page">
      <h1>О компании</h1>
      <p></p>
      <p>С</p>
      
      <h2>История компании</h2>
      <p></p>
      <p></p>
      <p></p>

      <h2>Команда</h2>
      <p></p>
      <p></p>
      <p></p>

      <h2>Услуги</h2>
      <ul>
        <li>
          <strong>Словач:</strong> Мы предлагаем полный цикл услуг по строительству жилых домов, включая проектирование, возведение фундамента, стен, крыши и отделку. Мы работаем с различными материалами, такими как кирпич, газобетон, дерево и другие.
        </li>
        <li>
          <strong>Проектч:</strong> Наша команда архитекторов и дизайнеров разработает индивидуальный проект вашего дома, учитывая все ваши пожелания и требования. Мы создаем функциональные и эстетически привлекательные решения, которые соответствуют современным стандартам.
        </li>
        <li>
          <strong>Отлч:</strong> Мы предлагаем услуги по внутренней и внешней отделке, включая штукатурку, покраску, укладку плитки и другие работы. Наша цель — создать комфортное и стильное пространство для жизни.
        </li>
        <li>
          <strong>Конс:</strong> Мы предоставляем консультации по всем вопросам, связанным со строительством и проектированием. Наша команда готова ответить на ваши вопросы и помочь вам на каждом этапе реализации проекта.
        </li>
        <li>
          <strong>Калькулятор стоимости строительства:</strong> Мы разработали удобный онлайн-калькулятор, который позволяет вам самостоятельно рассчитать стоимость строительства вашего дома, исходя из выбранных параметров и опций.
        </li>
      </ul>
      
      <p>Архитектура Комфорта — это ваш надежный партнер в строительстве, который поможет вам осуществить мечту о собственном доме с минимальными затратами времени и усилий. Мы гарантируем высокое качество, прозрачность и ответственность на всех этапах работы.</p>
      
      <div className="photos">
        <img src={ph2} alt="Карта 1" />
        <img src={ph3} alt="Карта 2" />
      </div>
    </div>
  );
};

export default AboutPage;
