import React from 'react';
import './Otzivi.css';

const Otzivi = () => {
    const otziviData = [
        {
            id: 1,
            name: "Анна и Сергей Петровы",
            text: `"Мы обратились в Архитектура Комфорта для строительства нашего первого дома, и остались в полном восторге! С самого начала команда проявила высокий уровень профессионализма и внимательности к нашим пожеланиям. Проект был разработан быстро и с учетом всех наших требований. Строительство прошло в срок, а качество работ превзошло наши ожидания. Теперь у нас есть уютный дом, в котором мы счастливо живем. Рекомендуем всем!"`,
        },
        {
            id: 2,
            name: "Игорь Сидоров",
            text: `"Хочу выразить благодарность Архитектура Комфорта за отличную работу! Я долго искал надежного подрядчика для строительства дачи, и, наконец, нашел. Команда профессионалов помогла мне на каждом этапе — от проектирования до отделки. Особенно понравился калькулятор стоимости, который позволил заранее понять, какие расходы нас ожидают. Все было сделано качественно и в срок. Обязательно буду рекомендовать вас своим друзьям!"`,
        },
        {
            id: 3,
            name: "Елена Кузнецова",
            text: `"С Архитектура Комфорта мы строили дом для нашей семьи. В целом, мы довольны результатом. Работы были выполнены качественно, и команда всегда была на связи, что очень важно. Единственное, что хотелось бы улучшить — это скорость выполнения некоторых этапов. Но в целом, мы получили именно тот дом, о котором мечтали. Спасибо за вашу работу!"`,
        },
    ];

    return (
        <div className="otzivi-container">
            <h1>Отзывы наших клиентов</h1>
            {otziviData.map((otzivi) => (
                <div key={otzivi.id} className="otzivi-card">
                    <h2 className="otzivi-name">{otzivi.name}</h2>
                    <p className="otzivi-text">{otzivi.text}</p>
                </div>
            ))}
        </div>
    );
};

export default Otzivi;
